name: "face_detection"
backend: "python"

max_batch_size: 0

input [
  {
    name: "IMAGE"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "BBOXES"
    data_type: TYPE_FP32
    dims: [ -1, 5 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
